Revit 2024 API
NurbsSurfaceData Constructor
 Copy constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public NurbsSurfaceData(
	NurbsSurfaceData other
)
Visual Basic
Public Sub New ( _
	other As NurbsSurfaceData _
)
Visual C++
public:
NurbsSurfaceData(
	NurbsSurfaceData^ other
)
Parameters
other
Type: Autodesk.Revit.DB.NurbsSurfaceData
 The NurbsSurfaceData to copy.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace